carlocaione/tdm2usb/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PULLUP_EN 0x20u        /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name FC5_SCK (coord G16), I2S_CLK
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_I2S_CLK_PERIPHERAL FLEXCOMM5              /*!<@brief Peripheral name */
#define BOARD_INITPINS_I2S_CLK_SIGNAL SCK                        /*!<@brief Signal name */
                                                                 /* @} */

/*! @name FC5_TXD_SCL_MISO_WS (coord G17), I2S_FYNC
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_I2S_FSYNC_PERIPHERAL FLEXCOMM5              /*!<@brief Peripheral name */
#define BOARD_INITPINS_I2S_FSYNC_SIGNAL TXD_SCL_MISO_WS            /*!<@brief Signal name */
                                                                   /* @} */

/*! @name FC5_RXD_SDA_MOSI_DATA (coord J16), I2S_SDIN
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_I2S_SDIN_PERIPHERAL FLEXCOMM5              /*!<@brief Peripheral name */
#define BOARD_INITPINS_I2S_SDIN_SIGNAL RXD_SDA_MOSI_DATA          /*!<@brief Signal name */
                                                                  /* @} */

/*! @name FC4_RXD_SDA_MOSI_DATA (coord C11), I2S_SDOUT
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_I2S_SDOUT_PERIPHERAL FLEXCOMM4               /*!<@brief Peripheral name */
#define BOARD_INITPINS_I2S_SDOUT_SIGNAL RXD_SDA_MOSI_DATA           /*!<@brief Signal name */
                                                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
